fn main() {
    println!("Hello, world");
    println!("I'm beginner in Rust🦀");
    
    //ค่าเริ่มต้นใน Rust เป็น immutable >> เปลี่ยนไม่ได้
    let x = 5;
    println!("x = {}", x);

    //ใช้ mut เพื่อให้แก้ค่าได้
    let mut y = 10;
    println!("y = {}", y);
    y = 20;
    println!("y = {}", y);

    //กำหนดชนิดข้อมูล(Data types)
    let z: i32 = 100;
    println!("z = {}", z);
    
    /*
    เรากำหนดชนิดข้อมูล หรือ Data types เพราะ
    1.ปลอดภัย ทำให้คอมไพเลอร์ตรวจสอบได้ตั้งแต่ตอนก่อนรัน ลดโอกาสเกิด bug เช่น ตัวหนังสือ บวก เลข โดยไม่ตั้งใจ
    2.เร็ว ไม่ต้องเช็คชนิดข้อมูลตอน runtime ถ้ารู้ล่วงหน้าว่าตัวแปรนี้ใช้กี่บิต คอมไพเลอร์ก็จัดการ memory ได้แม่นยำ เร็วขึ้น
    3.ประหยัดหน่วยความจำ เพราะเลือกชนิดข้อมูลตามความเหมาะสมแล้ว เรากำหนด type หรือชนิดข้อมูลเองเพื่อควบคุมประสิทธิภาพและหน่วยความจำ
    4.อ่านโค้ดง่ายขึ้น การระบุชนิดข้อมูลชัดเจนช่วยให้คนอ่านโค้ดเข้าใจแบบเร็วๆว่าตัวแปรนี้ควรใช้ทำอะไร 
    */
}